Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: འཛིན་པ་དང་འཆང་བ་དང་ཀློག་པ་དང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་དེ་བཞིན་ཉིད་དུ་ནན་ཏན་དུ་བྱེད་པར་འགྱུར་རོ།
en: Being devoted to it, they will also commit it to writing, and they will take up, uphold, recite, master, and focus their attention correctly on it, and they will earnestly apply it in an authentic manner.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉན་ཅིང་། ཐོས་ནས་ཀྱང་མོས་པར་བྱེད་པ་དང་། མོས་པར་བྱས་ནས་འདྲི་ཞིང་འཛིན་པ་དང་འཆང་ཞིང་ཀློག་པ་དང་ཀུན་ཆུབ་པར་བྱེད་ཅིང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་དུ་བྱེད་པ་དེ་དག་ནི་ཡུན་རིང་པོ་ནས་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་དང་། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བ་དང་། དགེ་བའི་རྩ་བ་བསྐྱེད་པར་རིག་པར་བྱའོ།
en: Śāradvatīputra, you should know that those noble sons or noble daughters who hear this profound perfection of wisdom, and having heard are also devoted to it, and who, being devoted to it, also commit it to writing, and take up, uphold, recite, master, and focus their attention correctly on it, and earnestly apply it in an authentic manner, have entered upon the vehicle for a long period of time, venerated many buddhas, been accepted by spiritual mentors, and grown the roots of virtuous action.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་སླད་མའི་དུས་སླད་མའི་ཚེ་ན། བྱང་གི་ཕྱོགས་ཆ་དེར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉན་ཅིང་ཐོས་ནས་མོས་པར་བགྱིད་པ་དང་། མོས་པར་བགྱིས་ནས་འདྲི་ཞིང་འཛིན་པ་དང་འཆང་ཞིང་ཀློག་པ་དང་ཀུན་ཆུབ་པར་བགྱིད་ཅིང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་དུ་བགྱིད་པ་དེ་ལྟ་བུ་ཇི་སྙེད་ཅིག་འབྱུང་བར་འགྱུར།
en: Blessed Lord, afterward, in the future, how many noble sons or noble daughters in the north will hear this profound perfection of wisdom, and having heard it, be devoted to it, and being devoted to it, commit it to writing, take up, uphold, recite, master, and focus their attention correctly on it, and earnestly apply it in an authentic manner?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན། བྱང་གི་ཕྱོགས་ཆ་དེར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ནི་མང་དུ་འབྱུང་སྟེ།
en: The Blessed One replied, “Śāradvatīputra, afterward, in the future, there will be many noble sons or noble daughters in the north who follow the vehicle of the bodhisattvas. {

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བསྟན་པའི་ཚེ། མི་འཇུམ་ཡོངས་སུ་མི་འཇུམ་མི་འཇིགས་མི་སྡང་སྐྲག་པར་མི་འགྱུར་བ་དེ་ལྟ་བུ་ནི་མང་ངོ་།
en: Ki.IV: 31} Śāradvatīputra, when this profound perfection of wisdom is revealed, there will be many such noble sons or noble daughters following the vehicle of the bodhisattvas who will not be cowed or discouraged, and not be fearful, afraid, or terrified.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མང་པོའི་རྗེས་སུ་འབྲངས་པ་དང་། རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མང་པོ་ལ་ཡོངས་སུ་ཞུས། ཡོངས་སུ་དྲིས་པའི་ཕྱིར་ཏེ། དེ་ཡང་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask why, it is because those noble sons or noble daughters will have followed many tathāgatas, arhats, completely awakened buddhas, and those noble sons or noble daughters will have petitioned and questioned many tathāgatas, arhats, completely awakened buddhas.

source: རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: And if again you ask why, those noble sons or noble daughters will perfect the perfection of wisdom.

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Those noble sons or noble daughters will perfect the perfection of meditative concentration.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Those noble sons or noble daughters will perfect the perfection of perseverance.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Those noble sons or noble daughters will perfect the perfection of tolerance.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Those noble sons or noble daughters will perfect the perfection of ethical discipline.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Those noble sons or noble daughters will perfect the perfection of generosity.

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ནང་སྟོང་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Those noble sons or noble daughters will perfect the emptiness of internal phenomena.

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Those noble sons or noble daughters will perfect [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དྲན་པ་ཉེ་བར་བཞག་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Those noble sons or noble daughters will perfect the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Those noble sons or noble daughters will perfect the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—and the extrasensory powers.

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Those noble sons or noble daughters will perfect the meditative stabilities and the dhāraṇī gateways.

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Those noble sons or noble daughters will perfect the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་དགེ་བའི་རྩ་བས་ཉེ་བར་བརྟན་པར་འགྱུར་ཏེ།
en: Śāradvatīputra, those noble sons or noble daughters will be supported by the roots of virtuous action.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དོན་དུ་སྐྱེ་བོ་མང་པོའི་དོན་བྱེད་པར་འགྱུར་རོ།
en: They will act for the sake of many living creatures, in order that unsurpassed, complete enlightenment might be attained.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཤ་ར་དྭ་ཏིའི་བུ། རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་ནི་ངས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་གཏམ་བརྗོད་དོ།
en: If you ask why, Śāradvatīputra, it is because I will have addressed those noble sons or noble daughters with words of all-aspect omniscience.

source: །འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཀྱང་། རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་གཏམ་བརྗོད་དེ། དེ་དག་ཚེ་འདས་ནས་ཀྱང་འདི་ལྟ་སྟེ།
en: All those lord buddhas who have appeared as tathāgatas, arhats, completely awakened buddhas in the past have also addressed those noble sons or noble daughters with words of all-aspect omniscience.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཉིད་ཀྱི་དོན་དུ་སྤྱོད་པ་ཉིད་དུ་འགྱུར་ཏེ་དེ་དག་གཞན་ལ་ཡང་འདི་ལྟ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དོན་དུ་རྣམ་པ་དེ་ལྟ་བུ་ཉིད་བརྗོད་པར་འགྱུར་རོ།
en: Even after they have passed away, they will still be committed to unsurpassed, complete enlightenment, and they will preach such modes [of all-aspect omniscience] to others for the sake of unsurpassed, complete enlightenment. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་མཉམ་པར་བཞག་པར་འགྱུར་ཏེ།
en: Ki.IV: 32} “Śāradvatīputra, those noble sons or noble daughters will be absorbed.

source: དེ་དག་ནི་བདུད་དམ་བདུད་ཀྱི་རིགས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་བཟློག་པར་མི་ནུས་ན། སྡིག་ཏོ་ལ་མོས་པ་དང་། སྡིག་ཏོའི་སྤྱོད་པ་ཅན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤོང་བ་གཞན་གྱིས་ལྟ་ཅི་སྨོས།
en: Since even Māra or the deities in the band of Māra will be unable to avert them from unsurpassed, complete enlightenment, how much less could others intent on evil and engaged in evil dissuade them from this profound perfection of wisdom!

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས། དགའ་ཞིང་ཉམས་བདེ་བ་རྒྱ་ཆེན་པོ་སྐྱེ་བར་འགྱུར་རོ།
en: Śāradvatīputra, those noble sons or noble daughters who follow the vehicle of the bodhisattvas, having heard this profound perfection of wisdom, will rejoice and a magnificent feeling of happiness will arise.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དོན་དུ་སྐྱེ་བོ་མང་པོ་ཡང་དགེ་བའི་ཆོས་ལ་འགོད་པར་འགྱུར་རོ།
en: They will indeed establish many living creatures in virtuous attributes for the sake of unsurpassed, complete enlightenment. “

source: །རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ནི་ངའི་མདུན་དུ་འདི་སྐད་དུ། བཅོམ་ལྡན་འདས་བདག་ཅག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་དང་སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དང་། སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་བྱང་ཆུབ་ཏུ་རབ་ཏུ་དགོད་པར་བགྱིའོ།
en: Those noble sons or noble daughters have in my presence said, ‘Blessed Lord, while practicing the conduct of a bodhisattva, we will establish many hundreds of creatures, many thousands of creatures, many hundreds of thousands of creatures in enlightenment.

source: །ཡང་དག་པར་བསྟན་པར་བགྱིའོ། །ཡང་དག་པར་བསྐུལ་བར་བགྱིའོ། །ཡང་དག་པར་གཟེང་བསྟོད་པར་བགྱིའོ། །ཡང་དག་པར་དགའ་བར་བགྱིའོ། །ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་པར་བགྱིའོ་ཞེས་བྱ་བའི་ཚིག་སྨྲས་སོ།
en: We shall teach it, encourage them toward it, incite them, rejoice with them, and prophesy their irreversibility.’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་ཚིག་ནི། སེམས་ལ་སེམས་ཀྱིས་རྣམ་པར་བལྟས་ཏེ་ངས་རྗེས་སུ་དགྱེས་པ་མཛད་དོ།
en: If you ask why, Śāradvatīputra, I have examined their thoughts with my mind and rejoiced in the words of those noble sons or noble daughters.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་སྤྱན་སྔར་ཡང་། རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་འདི་སྐད་དུ། བདག་ཅག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་དང་། སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དང་། སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་བྱང་ཆུབ་ཏུ་དགོད་པར་བགྱིའོ།
en: Śāradvatīputra, in the presence of the tathāgatas, arhats, completely awakened buddhas of the past, too, those noble sons or noble daughters have said, ‘While practicing the conduct of a bodhisattva, we will establish many hundreds of creatures, many thousands of creatures, many hundreds of thousands of creatures in enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་ཀྱང་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་ཚིག་ནི། སེམས་ལ་ཐུགས་ཀྱིས་རྣམ་པར་གཟིགས་ཏེ། རྗེས་སུ་དགྱེས་པར་མཛད་དོ།
en: If you ask why, the tathāgatas, arhats, completely awakened buddhas of the past have mentally examined their thoughts and rejoiced in the words of those noble sons or noble daughters.

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་དང་། སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དང་། སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་རབ་ཏུ་འགོད་པར་འགྱུར།
en: Śāradvatīputra, when those noble sons or noble daughters practice the conduct of a bodhisattva they will establish many hundreds of creatures, many thousands of creatures, many hundreds of thousands of creatures in unsurpassed, complete enlightenment. {

source: ཡང་དག་པར་སྟོན་པར་འགྱུར།
en: Ki.

source: ཡང་དག་པར་སྐུལ་བར་འགྱུར། ཡང་དག་པར་གཟེང་བསྟོད་པར་འགྱུར། ཡང་དག་པར་དགའ་བར་བྱེད་པར་འགྱུར། ཕྱིར་མི་ལྡོག་པར་ལུང་སྟོན་པར་འགྱུར་རོ།
en: IV: 33} They will teach it, encourage them toward it, incite them, rejoice with them, and prophesy their irreversibility. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་ལ་མོས་པ་རླབས་པོ་ཆེར་འགྱུར་ཏེ།
en: Śāradvatīputra, those noble sons or noble daughters will have sublime aspirations with regard to sights, sounds, odors, tastes, and tangibles.

source: དེ་དག་སྦྱིན་པ་རླབས་པོ་ཆེ་གཏོང་བར་འགྱུར།
en: They will give sublime gifts.

source: སྦྱིན་པ་རླབས་པོ་ཆེ་གཏོང་ཞིང་དགེ་བའི་རྩ་བ་རླབས་པོ་ཆེ་མངོན་པར་འདུ་བྱེད་པར་འགྱུར་རོ།
en: They will give sublime gifts and actualize the sublime roots of virtuous action.

source: །དེ་དག་དགེ་བའི་རྩ་བ་རླབས་པོ་ཆེ་མངོན་པར་འདུ་བྱས་ནས། རྣམ་པར་སྨིན་པ་རླབས་པོ་ཆེ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །དེ་དག་རྣམ་པར་སྨིན་པ་རླབས་པོ་ཆེ་ཡོངས་སུ་བཟུང་ནས།
en: Having brought into being the sublime roots of virtuous action, they will be favored with sublime outcomes.

source: སེམས་ཅན་དེ་དག་ཉིད་ཀྱི་དོན་དུ་རྣམ་པར་སྨིན་པ་རླབས་པོ་ཆེ་ལས་དེ་བས་ཀྱང་ཆེས་རླབས་ཆེ་བའི་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: Having been favored with sublime outcomes, they will for the sake of those beings be favored with even more sublime outcomes than those.

source: །དེ་ལྟར་ཕྱིའམ་ནང་གི་དངོས་པོ་དེ་དག་ཀྱང་སེམས་ཅན་དེ་དག་ཉིད་ལ་ཡོངས་སུ་གཏོང་བར་འགྱུར་ཏེ།
en: In this manner they will give their belongings, outer or inner, to those beings.

source: དེ་དག་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས། སངས་རྒྱས་ཀྱི་ཞིང་གཞན་གང་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉིད་ཀྱི་ཆོས་སྟོན་པ་མངོན་དུ་གྱུར་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་པ་ལ་བརྟེན་པར་འགྱུར་རོ།
en: Through those roots of virtuous action other buddhafields in which the tathāgatas, arhats, completely awakened buddhas are alive at present, teaching the Dharma of this profound perfection of wisdom, will become manifest, and they will rely on such pure buddhafields.

source: །དེ་དག་གི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་རྣམས་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་མངོན་སུམ་དུ་ཐོས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་དུའང་སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་དང་། སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དང་། སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་སྟོན་པར་འགྱུར་རོ།
en: Having manifestly heard from those tathāgatas, arhats, completely awakened buddhas this profound perfection of wisdom, in those buddhafields they will also teach it to many hundreds of creatures, many thousands of creatures, and many hundred thousands of creatures for the sake of unsurpassed, complete enlightenment.

source: །ཡང་དག་པར་སྐུལ་བར་འགྱུར་རོ། །ཡང་དག་པར་གཟེང་བསྟོད་པར་འགྱུར་རོ། །ཡང་དག་པར་དགའ་བར་བྱེད་པར་འགྱུར་རོ། །གསོལ་པ།
en: They will encourage them, incite them, and cause them to rejoice.” “

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་ལས། ཆོས་གང་ཐུགས་སུ་མ་ཆུད་པ་དེ་ལྟ་བུ་གང་ཡང་མ་མཆིས་ལ། དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་གང་ཐུགས་སུ་མ་ཆུད་པ་དེ་ལྟ་བུ་གང་ཡང་མ་མཆིས་ཏེ། སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཐུགས་སུ་མ་ཆུད་པ་དེ་ལྟ་བུ་གང་ཡང་མ་མཆིས་པ་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: Blessed Lord, it is most wonderful that, among the Dharmas of the past, future, and present, there is nothing that is not comprehended by the tathāgatas, arhats, completely awakened buddhas, no real nature or reality that is not comprehended, and no mind of beings that is not comprehended.

source: འདི་ལྟར་འདས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཡོངས་སུ་མཁྱེན་ཏོ། །འདས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱང་ཡོངས་སུ་མཁྱེན་ཏོ། །འདས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དང་། ཉན་ཐོས་རྣམས་ཀྱང་ཡོངས་སུ་མཁྱེན་ཏོ།
en: For they indeed know the bodhisattvas associated with past tathāgatas, they indeed know the tathāgatas of the past, and they indeed know the buddhafields and the śrāvakas associated with past tathāgatas.

source: །མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཡོངས་སུ་མཁྱེན་ཏོ། །མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དང་། ཉན་ཐོས་རྣམས་ཀྱང་ཡོངས་སུ་མཁྱེན་ཏོ།
en: They indeed know the bodhisattvas associated with future tathāgatas, and they indeed know the buddhafields and the śrāvakas associated with future tathāgatas.

source: །ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཡོངས་སུ་མཁྱེན་ཏོ། །ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དང་། ཉན་ཐོས་རྣམས་ཀྱང་ཡོངས་སུ་མཁྱེན་ཏོ།
en: They indeed know the bodhisattvas associated with present tathāgatas, and they indeed know the buddhafields and the śrāvakas associated with present tathāgatas.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཡོངས་སུ་མཁྱེན་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་དང་། ཉན་ཐོས་རྣམས་ཀྱང་ཡོངས་སུ་མཁྱེན་ཏོ། །བཅོམ་ལྡན་འདས་གང་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་གི་སླད་དུ་བརྩོན་པར་བགྱིད་ཅིང་།
en: They indeed know the bodhisattvas associated with all the tathāgatas, arhats, completely awakened buddhas who are alive at present, teaching the Dharma, in the world systems of the ten directions, and they indeed know their buddhafields and śrāvakas. {

source: ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ཚོལ་བ་དང་།
en: Ki.

source: ཡོངས་སུ་ཚོལ་བའི་ཚེ། རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ཚོལ་བ་དང་། ཡོངས་སུ་ཚོལ་བ་ལས་ཀྱང་། ལ་ལས་ནི་བཙལ་བ་ལས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ཐོབ་པར་འགྱུར། ལ་ལས་ནི་ཐོབ་པར་མི་འགྱུར་རོ།
en: IV: 34} “Blessed Lord, when bodhisattva great beings persevere for the sake of the six perfections and search for and investigate these six perfections, among those noble sons and noble daughters who search for and investigate these six perfections, are there some who will acquire these six perfections after searching for them, and some who will not acquire them?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་དེ་ལྟ་མ་ཡིན་ཏེ།
en: Śāradvatīputra, that is not the case,” replied the Blessed One. “

source: རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་བརྩོན་འགྲུས་མི་གཏོང་བ་དེ་དག་ཀུན་གྱིས་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: All those noble sons and noble daughters who do not abandon their perseverance will indeed acquire all these six perfections.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་གི་དོན་དུ་བརྩོན་པར་བྱེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: If you ask why, Śāradvatīputra, it is because those noble sons and noble daughters are persevering for the sake of these six perfections.” “

source: ཅི་ལགས་བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་མདོ་སྡེ་ཟབ་མོ་ཟབ་མོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པ་འདི་དག་ཀུན་ཀྱང་འགྲུབ་པར་འགྱུར་རམ།
en: Blessed Lord, is it the case that those noble sons and noble daughters will also acquire all the utterly profound sūtras that are associated with the six profound perfections?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་མདོ་སྡེ་ཟབ་མོ་ཟབ་མོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པ་འདི་དག་མི་འགྲུབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་གནས་མེད།
en: Śāradvatīputra,” replied the Blessed One, “it is impossible that those noble sons and noble daughters will not acquire these utterly profound sūtras that are associated with the six profound perfections.

source: སྐབས་མེད་དོ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: That cannot be.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་ཅན་རྣམས་ཡང་དག་པར་སྟོན་ཅིང་ཡང་དག་པར་སྐུལ་བ་དང་། ཡང་དག་པར་གཟེང་བསྟོད་པ་དང་། ཡང་དག་པར་དགའ་བར་བྱེད་པ་དང་། འགོད་ཅིང་རབ་ཏུ་གཞོག་པ་ལས་ཀྱང་དེ་བཞིན་དུ་འགྱུར་ཏེ། ཤ་ར་དྭ་ཏིའི་བུ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཚེ་འདས་ནས་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་འགྲུབ་པར་འགྱུར་རོ།
en: If you ask why, Śāradvatīputra, it is because, even after they have taught them to beings for the sake of unsurpassed, complete enlightenment, encouraging and inciting them, causing them to rejoice and securing them, it is the case, Śāradvatīputra, that once those noble sons and noble daughters have passed away, they will yet again acquire these six perfections.

source: །དེ་དག་ནི་ནམ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་མ་བྱས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མ་བྱས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་མ་གྱུར་གྱི་བར་དུ་ཇི་སྐད་དུ་བསྟན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་ལས་བརྩོན་འགྲུས་ཉམས་པར་མི་བྱེད་དོ།
en: Until they have refined the buddhafields, brought beings to maturity, and attained consummate buddhahood in unsurpassed, complete enlightenment, they will never slacken in their perseverance that derives from these six perfections, as they have been taught.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་སུམ་ཅུ་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: This completes the thirtieth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་པ་དེ་དག་གི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པ་ནི་འདི་དག་ལགས་ན། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྤྱོད་པ་དེ་དག་ལ་བར་ཆད་ཏུ་འགྱུར་བ་ཇི་ལྟ་བུ་དག་མཆིས།
en: Chapter 31 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if these are the stated attributes of those noble sons and noble daughters who have entered upon unsurpassed, complete enlightenment, who practice the six perfections, and who bring beings to maturity and refine the buddhafields, then, Blessed Lord, what sorts of obstacles will there be for those noble sons and noble daughters who engage in unsurpassed, complete enlightenment?” {

source: རབ་འབྱོར་སྤོབས་པ་ཧ་ཅང་འཕྱི་སྟེ་སྐྱེ་ན། རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ། །གསོལ་པ།
en: IV: 35} “Subhūti,” replied the Blessed One, “if inspired speech arises after a very long lapse of time, then, Subhūti, bodhisattva great beings should know that this is the work of Māra.” “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་སྤོབས་པ་ཧ་ཅང་འཕྱི་སྟེ་སྐྱེ་བར་འགྱུར།
en: Blessed Lord, for what reason will inspired speech arise after a very long lapse of time?

source: དེ་ནི་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དཀའ་བར་ཡོངས་སུ་རྫོགས་པར་བྱེད། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Why should bodhisattva great beings know that this is the work of Māra?” “

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དཀའ་བར་ཡོངས་སུ་རྫོགས་པར་བྱེད་ན། རབ་འབྱོར་རྣམ་གྲངས་དེས་ཤིན་དུ་འཕྱི་སྟེ་སྤོབས་པ་སྐྱེ་བར་འགྱུར་རོ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, if they perfect the perfection of wisdom with difficulty, and if they perfect the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity with difficulty, for this reason, Subhūti, their inspired speech will arise after an extremely long lapse of time.

source: །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ།
en: Bodhisattva great beings should know that this is the work of Māra. “
